{
  "_schema_version": "2.0",
  "_group": "body",
  "_last_updated": "2025-12-05",
  "metadata": {
    "group_id": "body",
    "display_name": "Body",
    "description": "Energy, drive, and strength"
  },
  "bucket_labels": {
    "0-25": {
      "label": "Drained",
      "guidance": "Treat energy as very low; recommend rest, recovery, and canceling non-essential plans where possible."
    },
    "25-50": {
      "label": "Running Low",
      "guidance": "Acknowledge tiredness but some capacity; advise pacing themselves, lighter tasks, and not overbooking."
    },
    "50-75": {
      "label": "Steady",
      "guidance": "Describe workable, dependable energy; fine for regular responsibilities and gentle movement."
    },
    "75-100": {
      "label": "Fired Up",
      "guidance": "Emphasize high physical charge; invite them to move, act, or use their body to channel and release that energy."
    }
  },
  "description": {
    "overview": "Body represents your physical vitality, motivation to act, and overall health and wellbeing.",
    "detailed": "This group combines three physical dimensions: Energy (physical energy and stamina), Drive (motivation to take action and pursue goals), and Strength (daily health routines and work-life balance). Together they show your overall physical and practical state. High scores mean you have energy, feel motivated, and your routines are supporting you. Low scores suggest exhaustion, low motivation, or neglected self-care.",
    "keywords": [
      "energy",
      "action",
      "health",
      "vitality",
      "wellness"
    ]
  },
  "advice_templates": {
    "quiet": {
      "challenging": "Your body needs rest - honor it now and you'll have more to give tomorrow",
      "mixed": "Physical energy is low but not empty - conserve for what matters most",
      "harmonious": "Your body is in deep recovery - let it rebuild. You're restoring, not stuck"
    },
    "mild": {
      "challenging": "Energy is building slowly - be patient. Short walks beat forcing a workout",
      "mixed": "Gentle physical energy today - light movement will actually give you more, not drain you",
      "harmonious": "Your body has easy energy - movement feels natural. Listen to what it wants"
    },
    "moderate": {
      "challenging": "Physical resistance is real - work with it, not against it. Short bursts beat marathons today",
      "mixed": "Physical energy requires effort but it's there - warm up slow, you'll find your stride",
      "harmonious": "Strong steady energy - this is your window for sustained effort. Use it"
    },
    "high": {
      "challenging": "Physical demands are intense - pace yourself strategically. You have the capacity, just not for everything",
      "mixed": "Drive is high but scattered - channel it into one physical priority. You'll crush it",
      "harmonious": "Peak physical performance - your body is ready for whatever you throw at it"
    },
    "extreme": {
      "challenging": "Physical exhaustion is real - rest isn't giving up, it's strategy. You'll come back stronger",
      "mixed": "Maximum physical output available but unsustainable - use it wisely, then recover hard",
      "harmonious": "Exceptional vitality - rare day. Challenge yourself physically. Your body can handle it"
    }
  }
}
