{
  "_schema_version": "2.0",
  "_group": "growth",
  "_last_updated": "2025-12-05",
  "metadata": {
    "group_id": "growth",
    "display_name": "Growth",
    "description": "Momentum, ambition, evolution, and circle"
  },
  "bucket_labels": {
    "0-25": {
      "label": "Stuck",
      "guidance": "Name the sense of being blocked; focus on acceptance and tiny next steps rather than forcing big change."
    },
    "25-50": {
      "label": "Uphill",
      "guidance": "Describe slow, effortful progress; encourage patience, discipline, and giving themselves credit for showing up."
    },
    "50-75": {
      "label": "Moving",
      "guidance": "Affirm that progress is happening; suggest continuing consistent action and noticing the small wins."
    },
    "75-100": {
      "label": "Taking Off",
      "guidance": "Frame this as a momentum phase; encourage bolder steps and saying yes to aligned opportunities when they appear."
    }
  },
  "description": {
    "overview": "Growth represents your external expansion - opportunities, career momentum, personal evolution, and social connections.",
    "detailed": "This group combines four growth dimensions: Momentum (favorable timing and doors opening), Ambition (professional momentum and recognition), Evolution (personal evolution and life transitions), and Circle (friendships and community connections). Together they show your overall external growth and expansion. High scores mean doors are opening, career is flowing, you're evolving naturally, and social connections feel easy. Low scores suggest closed doors, career obstacles, resistance to change, or social isolation.",
    "keywords": [
      "opportunities",
      "career",
      "evolution",
      "social",
      "expansion"
    ]
  },
  "advice_templates": {
    "quiet": {
      "challenging": "Growth is paused - use this time to prepare for when momentum returns",
      "mixed": "Subtle expansion happening beneath the surface - trust the process even if you can't see results",
      "harmonious": "Quiet growth - small seeds are taking root. Let them"
    },
    "mild": {
      "challenging": "Progress is slow but real - celebrate the inches when miles aren't available",
      "mixed": "Gentle forward motion - you're building something even if it doesn't feel dramatic",
      "harmonious": "Easy growth available - take the small opportunities. They compound"
    },
    "moderate": {
      "challenging": "Growth requires effort today - push through resistance, it's building your capacity",
      "mixed": "Some doors open, some closed - focus on what's working rather than forcing what isn't",
      "harmonious": "Solid momentum - keep doing what you're doing. It's working"
    },
    "high": {
      "challenging": "Big growth available but demanding - the opportunity is real, so is the price. Decide if it's worth it",
      "mixed": "Rapid expansion with some chaos - ride the wave, course-correct as needed",
      "harmonious": "Strong momentum - exceptional day for career moves, opportunities, and bold steps"
    },
    "extreme": {
      "challenging": "Maximum pressure to grow - this is the hard stuff that builds your next level. You're being forged",
      "mixed": "Everything is moving at once - stay centered and let the pieces fall where they need to",
      "harmonious": "Rare acceleration - all the lights are green. Go. This is your window"
    }
  }
}
