{
  "_schema_version": "2.0",
  "_group": "growth",
  "_last_updated": "2025-01-08",
  "metadata": {
    "group_id": "growth",
    "display_name": "Growth",
    "description": "Momentum, ambition, evolution, and circle"
  },
  "description": {
    "overview": "Growth represents your external expansion - opportunities, career momentum, personal evolution, and social connections.",
    "detailed": "This group combines four growth dimensions: Momentum (favorable timing and doors opening), Ambition (professional momentum and recognition), Evolution (personal evolution and life transitions), and Circle (friendships and community connections). Together they show your overall external growth and expansion. High scores mean doors are opening, career is flowing, you're evolving naturally, and social connections feel easy. Low scores suggest closed doors, career obstacles, resistance to change, or social isolation.",
    "keywords": [
      "opportunities",
      "career",
      "evolution",
      "community",
      "expansion"
    ]
  },
  "advice_templates": {
    "quiet": {
      "challenging": "Doors feel closed right now - use this time to build your foundation. When they open, you'll be ready",
      "mixed": "External momentum is low - quiet preparation is still progress. You're loading the spring",
      "harmonious": "Peaceful stability - rest now. The next growth phase is coming and you'll want the reserves"
    },
    "mild": {
      "challenging": "Progress is slow - frustrating but not stuck. Small steps compound. Keep moving",
      "mixed": "Gentle shifts in multiple directions - some doors opening, some closing. Both are making room",
      "harmonious": "Easy progress flowing - opportunities are finding you. Stay open and follow up"
    },
    "moderate": {
      "challenging": "Growth requires real effort right now - obstacles are there but so is your ability to push through them",
      "mixed": "Progress and setbacks happening together - that's normal growth. Focus on what's working",
      "harmonious": "Natural expansion across the board - career, opportunities, connections all flowing. Lean in"
    },
    "high": {
      "challenging": "Intense pressure to evolve - it's a lot, but pressure creates diamonds. You're becoming something new",
      "mixed": "Rapid change everywhere, exciting and overwhelming - you can handle the chaos. Pick your priorities",
      "harmonious": "Strong momentum across all growth areas - doors are opening fast. Walk through them"
    },
    "extreme": {
      "challenging": "Major transformation happening - this is hard but you're not breaking, you're being forged",
      "mixed": "Total upheaval - expansion and chaos at once. Stay grounded in who you are while everything shifts",
      "harmonious": "Peak expansion - exceptional opportunities and recognition. This is your moment. Claim it"
    }
  }
}