{
  "_schema_version": "2.0",
  "_group": "heart",
  "_last_updated": "2025-12-05",
  "metadata": {
    "group_id": "heart",
    "display_name": "Heart",
    "description": "Connections, resilience, and vulnerability"
  },
  "bucket_labels": {
    "0-25": {
      "label": "Heavy",
      "guidance": "Validate emotional weight or sadness; focus on comfort, gentleness, and lowering expectations of themselves and others."
    },
    "25-50": {
      "label": "Tender",
      "guidance": "Name their sensitivity; suggest soft boundaries, honest feelings shared in safe spaces, and not forcing tough talks."
    },
    "50-75": {
      "label": "Grounded",
      "guidance": "Describe steady, calm emotions; good for honest check-ins, stable connection, and showing up dependably."
    },
    "75-100": {
      "label": "Radiant",
      "guidance": "Highlight warmth and openness; invite them to share affection, appreciation, and love with people they trust."
    }
  },
  "description": {
    "overview": "Heart represents your emotional core, emotional security, and sensitivity to feelings around you.",
    "detailed": "This group combines three emotional dimensions: Connections (romantic connection and openness), Resilience (emotional groundedness and stability), and Vulnerability (empathy and emotional awareness). Together they show your overall emotional state. High scores mean your heart is open, you feel emotionally stable, and your sensitivity is a gift. Low scores suggest emotional distance, fragility, or overwhelming emotional absorption.",
    "keywords": [
      "love",
      "stability",
      "empathy",
      "emotional",
      "relationships"
    ]
  },
  "advice_templates": {
    "quiet": {
      "challenging": "Your heart needs rest - honor it now and you'll have more to give tomorrow",
      "mixed": "Emotional energy is low but not empty - conserve for what matters most",
      "harmonious": "Your heart is in deep recovery - let it rebuild. You're restoring, not stuck"
    },
    "mild": {
      "challenging": "Emotions are tender today - be patient with yourself. Small connections count",
      "mixed": "Gentle emotional energy - light touch in relationships will serve you well",
      "harmonious": "Your heart has easy warmth - let it flow naturally to those around you"
    },
    "moderate": {
      "challenging": "Emotional resistance is real - work with it, not against it. Choose your battles",
      "mixed": "Emotional energy requires effort but it's there - warm up slow, you'll find your rhythm",
      "harmonious": "Strong steady heart energy - this is your window for meaningful connection"
    },
    "high": {
      "challenging": "Emotional demands are intense - pace yourself strategically. You have the capacity, just not for everything",
      "mixed": "Feelings are big but scattered - channel into one relationship priority",
      "harmonious": "Peak emotional availability - your heart is ready for deep connection"
    },
    "extreme": {
      "challenging": "Emotional intensity is real - boundaries aren't walls, they're wisdom. Protect your energy",
      "mixed": "Maximum heart output available but unsustainable - love hard, then recover hard",
      "harmonious": "Exceptional emotional openness - rare day. Let yourself be fully present with people who matter"
    }
  }
}
