{
  "_schema_version": "2.0",
  "_group": "instincts",
  "_last_updated": "2025-12-05",
  "metadata": {
    "group_id": "instincts",
    "display_name": "Instincts",
    "description": "Vision, flow, intuition, and creativity"
  },
  "bucket_labels": {
    "0-25": {
      "label": "Off",
      "guidance": "Say their gut may feel unreliable or quiet; advise leaning more on facts, pauses, and second opinions instead of snap calls."
    },
    "25-50": {
      "label": "Noisy",
      "guidance": "Acknowledge mixed or conflicting signals; suggest slowing down, observing more, and not forcing a big read on situations."
    },
    "50-75": {
      "label": "Tuned In",
      "guidance": "Affirm that their intuition is fairly trustworthy; encourage listening to body cues and subtle nudges."
    },
    "75-100": {
      "label": "Razor Sharp",
      "guidance": "Emphasize very accurate instincts; invite them to trust their gut on choices, people, and timing."
    }
  },
  "description": {
    "overview": "Instincts represents your sense of meaning, spiritual connection, inner knowing, and creative flow.",
    "detailed": "This group combines four instinctual dimensions: Vision (life direction and meaning), Flow (spiritual belonging and unity), Intuition (inner guidance and awareness), and Creativity (creative flow and self-expression). Together they show your overall instinctual and creative state. High scores mean you feel aligned with your vision, spiritually connected, intuitively clear, and creatively flowing. Low scores suggest feeling lost, isolated, cut off from intuition, or creatively blocked.",
    "keywords": [
      "meaning",
      "spirituality",
      "intuition",
      "creativity",
      "inner knowing"
    ]
  },
  "advice_templates": {
    "quiet": {
      "challenging": "Your instincts need rest - don't force clarity. Trust that knowing will return",
      "mixed": "Intuitive energy is subtle today - sit with uncertainty rather than forcing answers",
      "harmonious": "Your instincts are quietly clear - small nudges are enough. Follow them"
    },
    "mild": {
      "challenging": "Inner signals are faint but there - give them space rather than pushing for big revelations",
      "mixed": "Gentle intuitive energy - trust the slow unfoldment of understanding",
      "harmonious": "Your instincts are flowing easily - subtle guidance is available if you listen"
    },
    "moderate": {
      "challenging": "Your gut is working but clouded - verify important instincts with logic or trusted people",
      "mixed": "Intuition is present but mixed - some signals are clear, others not. Discern carefully",
      "harmonious": "Strong intuitive clarity - trust your read on situations and people today"
    },
    "high": {
      "challenging": "Instincts are loud but possibly distorted - slow down before acting on strong hunches",
      "mixed": "Powerful intuition, some static - the strongest signals are probably right",
      "harmonious": "Peak intuitive accuracy - your gut is giving you real information. Act on it"
    },
    "extreme": {
      "challenging": "Intuitive overload - too many signals to process. Simplify and focus on what's clearest",
      "mixed": "Maximum intuitive input, hard to sort - the recurring themes are your truth",
      "harmonious": "Exceptional clarity - rare day when your instincts are fully online. Trust them completely"
    }
  }
}
