{
  "_schema_version": "2.0",
  "_group": "overall",
  "_last_updated": "2025-12-05",
  "metadata": {
    "group_id": "overall",
    "display_name": "Overall",
    "description": "Aggregated state across all 17 meters"
  },
  "bucket_labels": {
    "0-25": {
      "label": "Overwhelmed",
      "guidance": "Treat today as crisis-level or very intense; validate that everything may feel like 'too much' and keep advice ultra-small and focused on getting through, not optimizing."
    },
    "25-50": {
      "label": "Turbulent",
      "guidance": "Name the instability and swings; coach grounding, flexibility, and not overreacting to sudden emotional/energy spikes."
    },
    "50-75": {
      "label": "Peaceful",
      "guidance": "Frame the day as workable and fairly even; good for handling normal life and taking modest, steady steps forward."
    },
    "75-100": {
      "label": "Flowing",
      "guidance": "Encourage them to lean into the momentum, take aligned actions, and make the most of the good stretch."
    }
  },
  "description": {
    "overview": "Overall represents the combined energy and quality of all life areas today.",
    "detailed": "This aggregates all 17 meters (Mind, Heart, Body, Instincts, and Growth groups) to show the big picture of your day. The overall score shows how much astrological activity is affecting you, while harmony indicates whether that activity is supportive or challenging. This gives you an at-a-glance sense of today's energy before diving into specific areas.",
    "keywords": [
      "overall",
      "daily",
      "energy",
      "quality",
      "big picture"
    ]
  },
  "advice_templates": {
    "quiet": {
      "challenging": "Low-key day with some friction - nothing you can't handle. Use the quiet to recharge",
      "mixed": "Subtle energy today - not much happening either way. A good day to coast and recover",
      "harmonious": "Peaceful day ahead - the cosmos are giving you a break. Take it"
    },
    "mild": {
      "challenging": "Light challenges across the board - annoying but manageable. You've got this",
      "mixed": "Gentle mix of support and friction - nothing overwhelming. Roll with it",
      "harmonious": "Easy flowing day - small wins are available everywhere. Collect them"
    },
    "moderate": {
      "challenging": "Real challenges today requiring your attention - but you're equipped. One thing at a time",
      "mixed": "Active day with complexity to navigate - some things will flow, some won't. Focus on what's working",
      "harmonious": "Steady support across the board - good momentum available. Push forward on what matters"
    },
    "high": {
      "challenging": "Intense day ahead - the pressure is real but so is your capacity. Prioritize and execute",
      "mixed": "High activity everywhere, exciting and difficult at once - embrace the chaos, you'll come out ahead",
      "harmonious": "Strong cosmic support - exceptional day for bold moves. The stars are backing you"
    },
    "extreme": {
      "challenging": "Maximum intensity today - this is the hard stuff that builds character. You'll get through it and be stronger",
      "mixed": "Everything at once - chaos and opportunity colliding. Stay centered and you'll find the gold in the mess",
      "harmonious": "Rare peak alignment - everything is flowing your way. Make the big moves you've been waiting for"
    }
  }
}
