{
  "sign": "Aquarius",
  "dates": "January 20 - February 18 (Note: Birth time may affect exact cusps)",
  "symbol": "The Water Bearer",
  "glyph": "♒",
  "element": "Air",
  "modality": "Fixed",
  "polarity": "Masculine/Yang",
  "ruling_planet": "Uranus (Modern), Saturn (Traditional)",
  "ruling_planet_glyph": "♅, ♄",
  "planetary_dignities": {
    "exaltation": "None universally agreed upon",
    "detriment": "Sun",
    "fall": "None universally agreed upon"
  },
  "body_parts_ruled": [
    "Circulatory system",
    "Ankles",
    "Shins",
    "Calves",
    "Nervous system"
  ],
  "correspondences": {
    "tarot": "The Star (XVII)",
    "colors": [
      "Electric Blue",
      "Turquoise",
      "Silver",
      "Violet"
    ],
    "gemstones": [
      "Amethyst",
      "Garnet",
      "Aquamarine",
      "Lapis Lazuli"
    ],
    "metal": "Uranium, Aluminum",
    "day_of_week": "Saturday",
    "lucky_numbers": [
      4,
      7,
      11,
      22,
      29
    ]
  },
  "keywords": [
    "Visionary",
    "Humanitarian",
    "Intellectual",
    "Independent",
    "Unconventional",
    "Progressive",
    "Detached",
    "Rebellious"
  ],
  "positive_traits": [
    "Forward-thinking",
    "Original",
    "Scientifically-minded",
    "Objective",
    "Socially conscious",
    "Independent",
    "Friendly",
    "Innovative"
  ],
  "shadow_traits": [
    "Emotionally detached",
    "Stubborn",
    "Aloof",
    "Intellectually arrogant",
    "Unpredictable",
    "Contrarian for its own sake",
    "Hypocritical"
  ],
  "life_lesson": "To balance intellectual detachment with heartfelt, embodied compassion, connecting personal genius to the well-being of the community.",
  "evolutionary_goal": "To become an integrated visionary who leads from within the tribe, using innovative ideas to foster collective evolution and tangible social progress.",
  "mythology": "Associated with Ganymede, the beautiful youth abducted by Zeus to be the cupbearer to the gods, symbolizing a feeling of being chosen for a higher purpose. Also linked to Prometheus, the Titan who stole fire (knowledge) from the gods to give to humanity, representing rebellion against authority for the sake of collective enlightenment.",
  "seasonal_association": "Mid-winter in the Northern Hemisphere. A time of stillness when the light begins its return, symbolizing the dawning of new ideas and hope for the future.",
  "archetypal_roles": [
    "The Revolutionary",
    "The Scientist",
    "The Futurist",
    "The Exile",
    "The Truth-Teller"
  ],
  "health_tendencies": {
    "strengths": "A resilient nervous system when managed well; intellectual approach to health allows for effective research and problem-solving of physical issues.",
    "vulnerabilities": "Overactive nervous system leading to stress, anxiety, and insomnia. Prone to circulatory issues (varicose veins), and accidents involving the shins, calves, and ankles.",
    "wellness_advice": "Prioritize grounding activities (walking in nature, yoga), regular 'tech detoxes' to calm the nervous system, and mindfulness practices to quiet a racing mind. This is informational only and not a substitute for professional medical advice."
  },
  "compatibility_overview": {
    "same_sign": "Aquarius & Aquarius: A meeting of minds that offers mutual understanding of the need for freedom and innovation. Can be intellectually brilliant but may lack emotional warmth and struggle with compromise due to fixed opinions.",
    "most_compatible": [
      {
        "sign": "Gemini",
        "reason": "A highly synergistic Air-sign pairing. Their shared love for ideas, communication, and social connection creates a stimulating and easy-flowing bond."
      },
      {
        "sign": "Libra",
        "reason": "Another harmonious Air-sign match. Libra's diplomacy and focus on partnership balance Aquarius's revolutionary zeal, creating a socially adept and intellectually aligned couple."
      },
      {
        "sign": "Sagittarius",
        "reason": "A dynamic Fire-Air sextile. Both signs cherish freedom, adventure, and philosophical exploration, creating a supportive and forward-looking partnership."
      }
    ],
    "challenging": [
      {
        "sign": "Taurus",
        "reason": "A challenging square between two Fixed signs. Taurus's love for tradition and stability clashes directly with Aquarius's need for rebellion and change."
      },
      {
        "sign": "Scorpio",
        "reason": "A Fixed-sign square that creates intense friction. Scorpio's deep emotional needs and desire for fusion conflict with Aquarius's intellectual detachment and need for autonomy."
      }
    ],
    "growth_oriented": [
      {
        "sign": "Leo",
        "reason": "An opposition of 'self' vs. 'collective.' Leo teaches Aquarius about individual passion and heart-centered warmth, while Aquarius teaches Leo about the greater good, creating a powerful polarity."
      },
      {
        "sign": "Cancer",
        "reason": "A classic mind-vs-heart dynamic. Cancer can teach the detached Aquarius about emotional security and nurturing, pushing them toward greater empathy and connection."
      }
    ]
  },
  "summary": "Aquarius, the eleventh sign of the zodiac, is a Fixed Air sign ruled by both orderly Saturn and revolutionary Uranus. This creates a brilliant, paradoxical archetype: the Water Bearer who pours knowledge for humanity. Aquarians are forward-thinking humanitarians, innovators, and rebels, driven by a desire for social progress. Their greatest challenge and purpose is to bridge their detached, intellectual world with genuine emotional connection, using their unique vision to serve the collective.",
  "domain_profiles": {
    "love_and_relationships": {
      "style": "Prefers relationships that begin as friendships, built on intellectual synergy, shared ideals, and mutual respect for independence.",
      "needs": "Freedom, personal space, mental stimulation, and a partner who is also their best friend.",
      "gives": "Unwavering loyalty, intellectual excitement, and a commitment to a partnership of equals.",
      "challenges": "Can appear emotionally distant or aloof. May rationalize feelings rather than express them. Dislikes neediness and conventional relationship expectations.",
      "attracts": "Intelligent, independent, and socially conscious individuals who are not afraid to be different.",
      "communication_style": "Logical, objective, and idea-oriented. Prefers discussing theories and future possibilities over dissecting personal feelings."
    },
    "family_and_friendships": {
      "friendship_style": "Views friends as their 'chosen family' or 'tribe.' Cultivates a wide, diverse circle of friends based on shared interests and ideals rather than convenience.",
      "parenting_style": "Progressive, open-minded, and friendship-oriented. Encourages their child's unique talents and independence but may struggle with setting firm boundaries.",
      "childhood_needs": "Freedom to be eccentric and explore unique interests. A family environment that celebrates their individuality rather than forcing conformity.",
      "family_role": "The agent of change and progress, often challenging family traditions and encouraging new ways of thinking.",
      "sibling_dynamics": "Supportive and encouraging of their siblings' individuality. Shows love through shared ideas and loyalty rather than overt emotional displays."
    },
    "path_and_profession": {
      "career_strengths": [
        "Science and Technology",
        "Social Activism and Non-Profit Work",
        "Research and Data Analysis",
        "Astrology and Alternative Sciences",
        "Innovation Consulting"
      ],
      "work_style": "Highly independent and autonomous. Thrives when given the freedom to solve complex problems in their own way. Hates micromanagement and repetitive tasks.",
      "leadership_approach": "Empowering and visionary. Leads by inspiring a shared goal and delegating effectively, but can seem distant or disengaged from the team's interpersonal dynamics.",
      "ideal_work_environment": "Collaborative yet flexible. A setting that values innovation, forward-thinking ideas, and has a clear social or humanitarian mission.",
      "growth_area": "Learning to connect with colleagues on a more personal level and appreciating the value of process and emotion in a team setting."
    },
    "personal_growth_and_wellbeing": {
      "growth_path": "Integrating the logical mind with the wisdom of the heart. Learning to value emotional intelligence as much as intellectual brilliance.",
      "healing_modalities": [
        "Energy medicine (Reiki, sound baths)",
        "Breathwork",
        "Community-based activism",
        "Mindfulness meditation"
      ],
      "stress_triggers": "Feeling constrained, misunderstood, or forced to conform. Injustice, rigid systems, and emotionally demanding situations.",
      "stress_relief_practices": "Deep conversations with like-minded friends, time alone to recharge, engaging in a creative or intellectual hobby, 'tech detoxes'.",
      "mindfulness_approach": "Open-awareness meditation that allows observation of thoughts without judgment, helping to calm their overactive 'electric' mind."
    },
    "finance_and_abundance": {
      "money_mindset": "A paradox: can be practical and frugal (Saturn) to ensure freedom, but also unconventional and risk-taking (Uranus) with investments.",
      "earning_style": "Prefers to earn money through work that aligns with their ideals and allows for intellectual freedom, often in tech or humanitarian fields.",
      "spending_patterns": "Prioritizes spending on experiences, technology, and charitable causes over luxury material goods. Can be generous to others while being stingy with themselves.",
      "abundance_lesson": "To create a financial structure that supports both personal independence and their humanitarian vision, finding a balance between security and innovation.",
      "financial_advisory_note": "This information is for entertainment and informational purposes only and does not constitute financial advice."
    },
    "life_purpose_and_spirituality": {
      "spiritual_path": "A path of collective consciousness and humanitarian service. Spirituality is often expressed through a search for universal truths and social justice.",
      "soul_mission": "To act as a conduit for future-oriented ideas, helping to evolve humanity's consciousness by challenging outdated systems and introducing new possibilities.",
      "spiritual_practices": [
        "Volunteering for a cause",
        "Group meditation or activism",
        "Studying esoteric systems like astrology",
        "Journaling to process intellectual insights"
      ],
      "connection_to_divine": "Experiences the divine through flashes of insight (Uranus), the interconnectedness of all beings, and the elegant logic of the cosmos (Saturn)."
    },
    "home_and_environment": {
      "home_needs": "An open, airy, light-filled space that allows for freedom of movement and thought. A hub for social gatherings and a laboratory for ideas.",
      "decorating_style": "Modern, futuristic, minimalist, and eclectic. Favors clean lines, smart technology, and unique, avant-garde art pieces.",
      "location_preferences": "Urban centers with cultural diversity and intellectual stimulation, or places that are off-the-grid and allow for total independence.",
      "relationship_to_space": "Home is a launchpad for ideas and social connection, not a cozy retreat. Values function and futuristic form over sentimental clutter.",
      "seasonal_home_adjustments": "May update technology or rearrange social spaces to align with new intellectual projects or social causes they are focused on."
    },
    "decisions_and_crossroads": {
      "decision_making_style": "Highly logical, objective, and detached. Analyzes problems from a future-oriented, 'big picture' perspective, weighing pros and cons impersonally.",
      "decision_tips": "Balance logic with intuition and consider the emotional impact on others. Avoid getting stuck in analysis paralysis by testing ideas on a small scale.",
      "when_stuck": "Detaches to gain a higher perspective, consults their 'tribe' of trusted friends for ideas, or seeks a radical change of scenery to spark a breakthrough.",
      "crisis_response": "Stays remarkably cool and rational under pressure, focusing on logical solutions. Can appear unnervingly calm or disconnected during emotional turmoil.",
      "advice_for_major_choices": "Ensure the choice aligns with your core values of freedom, progress, and humanitarianism. Don't just think about the logical outcome; visualize how it will feel and how it will contribute to the collective good."
    }
  }
}
