{
  "_schema_version": "2.0",
  "_meter": "connections",
  "_last_updated": "2025-01-04",
  "metadata": {
    "meter_id": "connections",
    "display_name": "Connections",
    "group": "heart",
    "measures": "both"
  },
  "description": {
    "overview": "Connections represents your romantic connection energy, openness to intimacy, and the flow of affection in relationships.",
    "detailed": "This meter tracks Venus and Mars transits to your natal Venus, Moon, and 7th house (partnerships). Venus governs romantic attraction, affection, and relationship harmony. Mars adds passion and desire but can create conflict. The Moon shows emotional availability. When these planets form supportive aspects, love flows naturally and you feel open to connection. Challenging aspects create relationship tension, defensiveness, or difficulty giving and receiving affection. Venus retrograde reduces romantic flow by 30%.",
    "keywords": [
      "relationships",
      "harmony",
      "connection",
      "emotions",
      "relating"
    ]
  },
  "astrological_foundation": {
    "primary_planets": {
      "venus": "Rules romantic love, affection, and relationship harmony",
      "moon": "Emotional availability and nurturing capacity in relationships"
    },
    "secondary_planets": {
      "mars": "Passion and desire - adds heat but can create conflict",
      "jupiter": "Expands love and generosity when supportive"
    },
    "natal_planets_tracked": [
      "venus",
      "moon"
    ],
    "transit_planets_tracked": [
      "venus",
      "mars",
      "moon",
      "jupiter",
      "saturn"
    ],
    "key_houses": {
      "7": "Committed partnerships, one-on-one romantic bonds"
    },
    "aspect_weights": {
      "conjunction": "Maximum romantic impact - intense connection or intensity",
      "opposition": "High impact - tension between independence and togetherness",
      "trine": "High flow - love comes easily and naturally",
      "square": "Moderate friction - relationship challenges to work through",
      "sextile": "Moderate flow - opportunities for connection"
    },
    "planetary_dignities": {
      "venus": {
        "strong_in": [
          "libra",
          "taurus",
          "pisces"
        ],
        "weak_in": [
          "aries",
          "scorpio",
          "virgo"
        ]
      },
      "mars": {
        "strong_in": [
          "aries",
          "scorpio",
          "capricorn"
        ],
        "weak_in": [
          "libra",
          "taurus",
          "cancer"
        ]
      }
    },
    "critical_degrees": [
      0,
      15,
      29
    ]
  },
  "interpretation_guidelines": {
    "tone": "Relational and heart-centered - talk about intimacy, vulnerability, partnership dynamics",
    "focus_when_high": "Emphasize expressing love, deepening intimacy, having vulnerable conversations, quality time",
    "focus_when_low": "Emphasize self-love, not forcing connection, honoring need for space",
    "focus_when_challenging": "Acknowledge relationship tension but focus on communication and understanding, not blame",
    "avoid": [
      "Making them feel unlovable",
      "Catastrophizing relationship issues",
      "Ignoring legitimate relationship problems"
    ],
    "phrasing_examples": {
      "high_harmonious": "Love flows beautifully today - your heart is open and connection comes naturally. This is your window for vulnerable talks or deepening intimacy.",
      "moderate_mixed": "Romantic energy is complicated today with both closeness and friction - be patient with yourself and your partner as you navigate mixed feelings.",
      "low_challenging": "Connection feels harder today - honor your need for space rather than forcing affection you don't feel right now."
    }
  },
  "configuration": {
    "natal_planets": [
      "venus",
      "moon"
    ],
    "natal_houses": [
      7
    ],
    "retrograde_modifiers": {
      "venus": 0.7
    }
  }
}